<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [310]:
import pandas as pd
import psycopg2

In [33]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [449]:
connection = psycopg2.connect(
    dbname='',
    user='',
    host='',
    password='',
    port=
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [216]:
# текст запроса
query_3_1 = f'''select count(id) vacancies
                from public.vacancies
'''
vac_count = pd.read_sql_query(query_3_1, connection)
vac_count

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3229976984.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vac_count = pd.read_sql_query(query_3_1, connection)

   vacancies
0      49197

In [211]:
# результат запроса

# В базе 49197 вакансий.

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [215]:
# текст запроса
query_3_2 = f'''select count(id) employers
                from public.employers
'''
employers_count = pd.read_sql_query(query_3_2, connection)
employers_count

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\4069832050.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers_count = pd.read_sql_query(query_3_2, connection)

   employers
0      23501

In [212]:
# результат запроса

# Количество работодателей: 23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [214]:
# текст запроса
query_3_3 = f'''select count(id) areas
                from public.areas
'''
areas_count = pd.read_sql_query(query_3_3, connection)
areas_count

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\1627132054.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  areas_count = pd.read_sql_query(query_3_3, connection)

   areas
0   1362

In [213]:
# результат запроса

# Количество регионов в базе: 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [217]:
# текст запроса
query_3_4 = f'''select count(id) industries
                from public.industries
'''
industries_count = pd.read_sql_query(query_3_4, connection)
industries_count

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\482078923.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  industries_count = pd.read_sql_query(query_3_4, connection)

   industries
0         294

In [218]:
# результат запроса

# Количество сфер деятельности в базе: 294

***

In [219]:
# выводы по предварительному анализу данных

# Предварительный анализ данных показал, что в базе 49197 вакансий,
# которые подали 23501 работодателей по 294 сферам деятельности и из 1362 городов.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [60]:
# текст запроса
query_4_1 = f'''select count(v.id) cnt,
                       a.name area
                from public.vacancies v
                    left join public.areas a on a.id=v.area_id
                group by area
                order by cnt desc
                limit 5
'''
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\184163303.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

In [220]:
# результат запроса

# ТОП-5 городов по количеству вакансий: Москва, Санкт-Петербург, Минск, Новосибирск, Алматы в порядке убывания.

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [221]:
# текст запроса
query_4_2 = f'''select count(id) vacancies
                from public.vacancies
                where salary_from is not null or salary_to is not null
'''
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\215993769.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   vacancies
0      24073

In [222]:
# результат запроса

# Количество вакансий, у которых заполнено хотя бы одно поле с зарплатой (от-до): 24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [224]:
# текст запроса
query_4_3 = f'''select avg(salary_from) avg_salary_from,
                       avg(salary_to) avg_salary_to
                from public.vacancies
                
'''
df = pd.read_sql_query(query_4_3, connection)
round(df)

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\257494538.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

In [225]:
# результат запроса

# Среднее значение нижней границы зарплаты: 71065
# Среднее значение верхней границы зарплаты: 110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [61]:
# текст запроса
query_4_4 = f'''select distinct schedule,
                       employment,
                       count(id) count_vacancies
                from public.vacancies
                group by schedule, employment
                order by count_vacancies  desc
                offset 1 limit 1
'''
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3031640251.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

           schedule        employment  count_vacancies
0  Удаленная работа  Полная занятость             7802

In [226]:
# результат запроса

# На втором месте по популярности:
#Удалённая работа — Полная занятость, количество: 7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [62]:
# текст запроса
query_4_5 = f'''select experience,
                       count(id) count_vacancies
                from public.vacancies
                group by experience
                order by count_vacancies
'''
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\551506666.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count_vacancies
0         Более 6 лет             1337
1           Нет опыта             7197
2       От 3 до 6 лет            14511
3  От 1 года до 3 лет            26152

In [ ]:
# результат запроса

# Порядок опыта работы по возрастанию количества ваканcий, в которых он указан, такой:
#  Более 6 лет — Нет опыта — От 3 до 6 лет — От 1 года до 3 лет

***

In [229]:
# выводы по детальному анализу вакансий

# Анализ вакансий показал, что ТОП-5 городов по количеству вакансий: Москва, Санкт-Петербург, Минск, Новосибирск, Алматы в порядке убывания.
# Количество вакансий, у которых заполнено хотя бы одно поле с зарплатой (от-до) 24073 из 49197, то есть примерно у 50% вакансий.
# Среднее значение нижней границы зарплаты: 71065 руб., среднее значение верхней границы зарплаты: 110537 руб.
# Максимальное количество вакансий по типу рабочего графика и типу трудоустройства: полная занятость на полный день,
# второе по количеству значение: удаленная работа, полный день.
# Самое большое количество вакансий с опытом работы от 1 года до 3 лет, на втором месте от 3 лет до 6 лет. Меньше всего вакансий для опытных
# соискателей (менее 3%) и для соискателей без опыта работы (почти 15%).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [252]:
# текст запроса
query_5_1 = f'''select 
                        e.name employers,
                        count(v.id) count_vacancies
                from public.employers e
                left join public.vacancies v on e.id=v.employer_id
                group by e.name
                order by count_vacancies desc
                limit 5
'''
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3466221914.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

       employers  count_vacancies
0         Яндекс             1933
1     Ростелеком              491
2       Тинькофф              444
3           СБЕР              428
4  Газпром нефть              331

In [ ]:
# результат запроса
# Согласно ТОП-5 работодателей по количеству вакансий, на первои и пятом местах: Яндекс — Газпром нефть.

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [253]:
# текст запроса
query_5_2 = f'''select 
                        a.name area,
                        count(e.id) employers_count,
                        count(v.id) vacancies_count
                from public.areas a
                left join public.employers e on e.area=a.id
                left join public.vacancies v on a.id=v.area_id
                group by a.name
                having count(v.id) = 0
                order by employers_count desc
'''
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\730903910.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                             area  employers_count  vacancies_count
0                          Россия              410                0
1                       Казахстан              207                0
2              Московская область               75                0
3              Краснодарский край               19                0
4              Ростовская область               18                0
..                            ...              ...              ...
588                      Струнино                0                0
589    Славгород (Алтайский край)                0                0
590                     Сорочинск                0                0
591  Ленинский (Тульская область)                0                0
592                         Тавда                0                0

[593 rows x 3 columns]

In [254]:
# результат запроса
# Среди регионов, в которых нет вакансий, но есть работодатели, самое большое количество работодателей в России.

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [67]:
# текст запроса
query_5_3 = f'''select e.name employer,
                        count(distinct v.area_id) areas
                from public.employers e
                    left join public.vacancies v on e.id=v.employer_id
                group by e.id
                order by areas desc               
'''
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3669244751.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                     employer  areas
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
23496              Но Смокинг      0
23497        МАСТЕРСКАЯ CREED      0
23498           Dzing Finance      0
23499                    КОРС      0
23500             Наука-Связь      0

[23501 rows x 2 columns]

In [240]:
# результат запроса
# В самом большем количестве регионов представлена компания Яндекс, количество регионов - 181.

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [69]:
# текст запроса
query_5_4 = f'''select
                        count(e.id) count_employers
                from public.employers e
                left join public.employers_industries ei on e.id=ei.employer_id
                where ei.industry_id is null
'''
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\423633091.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count_employers
0             8419

In [255]:
# результат запроса
# Сфера деятельности не указана у 8419 работодателей из 23501 работодателей.

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [237]:
# текст запроса
query_5_5 = f'''select
                        e.name employer,
                        count(ei.industry_id) count_industry
                from public.employers e
                left join public.employers_industries ei on e.id=ei.employer_id
               group by e.id
               having count(ei.industry_id) = 4
               order by employer
              offset 2 limit 1
'''
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3326335245.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

  employer  count_industry
0     2ГИС               4

In [238]:
# результат запроса
# На третьем месте в списке в алфавитном порядке компания 2ГИС, у которой указано 4 сферы деятельности.

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [71]:
# текст запроса
query_5_6 = f'''select
                        count(e.id) employers
                from public.employers e
                left join public.employers_industries ei on e.id=ei.employer_id
                left join public.industries i on i.id=ei.industry_id
                where i.name='Разработка программного обеспечения'
'''
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\2548167879.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   employers
0       3553

In [241]:
# результат запроса
# У 3553 работодателей указана сфер деятельности: Разработка программного обеспечения. Это примерно 15% от общего количества работодателей.

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [242]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
table = pd.read_html(url)
table_of_big_city = table[1]
table_of_big_city = table_of_big_city.replace({'Город':{'Воронеж[a]':'Воронеж'}}) # убираю в названии города дополнительную информацию [а]
cities = table_of_big_city['Город'].values.tolist()
cities = tuple(cities)
print(cities)

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')

In [256]:
# текст запроса
query_5_7 = f'''(select
                     a.name area,
                     count(v.id) as cnt
                from public.employers e
                left join public.vacancies v on e.id=v.employer_id
                left join public.areas a on a.id=v.area_id
                where e.name='Яндекс' AND a.name in {cities}
                group by e.name,a.name
                order by cnt)
                
                UNION ALL
               
               --запрос и подзапрос для подсчета общего числа вакансий   
                select
                         'Total',
                         sum(cnt) from   
                                   (select count(v.id) as cnt  
                                        from public.employers e
                                        left join public.vacancies v on e.id=v.employer_id
                                        left join public.areas a on a.id=v.area_id
                                        where e.name='Яндекс' AND a.name in {cities}
                                        group by e.name,a.name) as tmp
'''                 
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3997934258.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               area    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7               Уфа   26.0
8            Самара   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

In [243]:
# результат запроса
# Видно, что компания Яндекс размещает больше всего вакансий в таких городах-миллионниках, как Москва, Санкт-Петебург и Екатеринбург.
# Общее количество вакансий в городах-миллионниках 485 вакансий.

***

In [249]:
# выводы по анализу работодателей
 
# ТОП-5 работодателей по количеству вакансий: Яндекс, Ростелеком, Тинькофф, СБЕР, Газпром нефть.
# У многих работодателей вакансии размещены в разных регионах. Самое большое количество регионов у компаний - Яндекс, Ростелеком и Спецремонт.
# Есть регионы, где нет вакансий, но есть работодатели, больше всего таких работодателей в России и Казахстане.
# Так же есть работодатели, у которых не указана сфера деятельности (это 8419 работодателей из 23501, почти 36 %).
# Это может затруднять выбор вакансии для соискателя.
#
# У многих работодателей указано 4 сферы деятельности, таких 1138 работодателей.
#
# У 15% работодателей (3553) указана сфера деятельности - Разработка программного обеспечения.
#
# Мы изучили размещение вакансий в городах-миллионниках на примере одного из самых крупных (по вакансиям и регионам) работодателя: Яндекс.
# Всего в городах-миллионниках размещено 485 ваакансий. Больше всего в городах: Москва, Санкт-Петебург и Екатеринбург.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [91]:
# текст запроса
query_6_1 = f'''select
                        count(id) vacancies
                from public.vacancies
                where lower(name) like '%data%' or lower(name) like '%данн%'
'''
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\724975278.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   vacancies
0       1771

In [250]:
# результат запроса
# К данным имеет отношение 1771 вакансий.

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [258]:
# текст запроса
query_6_2 = f'''select
                        count(id) vacancies
                from public.vacancies
                where (lower(name) like '%data scientist%' 
                or lower(name) like '%data science%' 
                or lower(name) like '%исследователь данных%'
                or (name like '%ML%' and lower(name) not like '%html%') 
                or lower(name) like '%machine learning%' 
                or lower(name) like '%машинн%обучен%%')
                
                and (lower(name) like '%junior%' 
                or lower(experience) like '%нет опыта%' 
                or lower(employment) like '%стажировка%')
'''
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\2846664794.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   vacancies
0         51

In [259]:
# результат запроса
# Для начинающего дата-сайентиста есть 51 вакансия.

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [114]:
# текст запроса
query_6_3 = f'''select
                        count(id) vacancies
                from public.vacancies
                where (lower(name) like '%data scientist%' 
                or lower(name) like '%data science%' 
                or lower(name) like '%исследователь данных%'
                or (name like '%ML%' and lower(name) not like '%html%') 
                or lower(name) like '%machine learning%' 
                or lower(name) like '%машинн%обучен%%')
                
                and (lower(key_skills) like '%sql%' 
                or lower(key_skills) like '%postgres%')
'''
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\4072497035.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   vacancies
0        201

In [260]:
# результат запроса
# Есть 201 вакансия, где в качестве навыков указан sql или postgres.

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [115]:
# текст запроса
query_6_4 = f'''select
                        count(id) vacancies
                from public.vacancies
                where (lower(name) like '%data scientist%' 
                or lower(name) like '%data science%' 
                or lower(name) like '%исследователь данных%'
                or (name like '%ML%' and lower(name) not like '%html%') 
                or lower(name) like '%machine learning%' 
                or lower(name) like '%машинн%обучен%%')
                
                and (lower(key_skills) like '%python%')
'''
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\11270176.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   vacancies
0        351

In [262]:
# результат запроса
# Количество вакансий для DS, где в качестве ключевого навыка указан Python - 351.

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [266]:
# текст запроса
query_6_5 = f'''select 
                        round(avg(length), 2)  avg_count_key_skills from
                --считаю количество символов табуляции, прибавляю 1 и получаю количество навыков, разделенных этой табуляцией
                (select length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1 length
                from public.vacancies
                where (lower(name) like '%data scientist%' 
                or lower(name) like '%data science%' 
                or lower(name) like '%исследователь данных%'
                or (name like '%ML%' and lower(name) not like '%html%') 
                or lower(name) like '%machine learning%' 
                or lower(name) like '%машинн%обучен%%')
                
                and key_skills is not null) as tmp
'''
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\101327868.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   avg_count_key_skills
0                  6.41

In [267]:
# результат запроса
# В среднем указывают в вакансиях для DS 6.41 ключевых навыков.

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [287]:
# текст запроса
query_6_6 = f'''
                select
                        round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) as salary
                        
                        from public.vacancies
                        where (lower(name) like '%data scientist%' 
                        or lower(name) like '%data science%' 
                        or lower(name) like '%исследователь данных%'
                        or (name like '%ML%' and lower(name) not like '%html%') 
                        or lower(name) like '%machine learning%' 
                        or lower(name) like '%машинн%обучен%%')
                
                        and (salary_from is not null or salary_to is not null)
                        and (experience = 'От 3 до 6 лет')
'''
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\144997576.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

     salary
0  243115.0

In [269]:
# результат запроса
# Средняя зарплата для DS с опытом работы 3-6 лет: 243 115 руб.

***

In [279]:
# выводы по предметному анализу

# Среди вакансий к данным имеет отношение 1771 вакансий. При более детальном описании вакансий для DS, их получается 480.
# Далее анализ вакансий будет основываться на выборке для DS.
# 
# Из 480 вакансий для начинающего дата сайентиста 51 вакансия.
# Есть 201 вакансия, где в качестве навыков указан sql или postgres. И 351 вакансия, где указан ключевой навык Python.
# В вакансиях для DS  в среднем указано чуть больше 6-ти ключевых навыков (6.41). То есть соискатель для успешного
# поиска работы должен стремиться к освоению достаточного количества ключевых навыков.
# 
# Средняя зарплата для DS в зависимости от опыта: Нет опыта - 74 643 руб.
# От 1 года до 3 лет - 139 675 руб.
# От 3 до 6 лет - 243 115 руб.
# Можно сделать вывод, что зарплата опытного сотрудника больше в три раза в среднем, чем работника без опыта.

# Общий вывод по проекту

In [458]:
query_ed_1 = f'''select
                        count(id) vacancies
                from public.vacancies
                where (lower(name) like '%data scientist%' 
                or lower(name) like '%data science%' 
                or lower(name) like '%исследователь данных%'
                or (name like '%ML%' and lower(name) not like '%html%') 
                or lower(name) like '%machine learning%' 
                or lower(name) like '%машинн%обучен%%')
'''
df = pd.read_sql_query(query_ed_1, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\437960273.py:11: UserWarning:

pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.

   vacancies
0        480

In [305]:
query_ed_2 = f'''
                select
                        a.name,
                        count(v.id) count_vacancies
                        
                        from public.vacancies v
                        left join public.areas a on v.area_id=a.id
                        where (lower(v.name) like '%data scientist%' 
                        or lower(v.name) like '%data science%' 
                        or lower(v.name) like '%исследователь данных%'
                        or (v.name like '%ML%' and lower(v.name) not like '%html%') 
                        or lower(v.name) like '%machine learning%' 
                        or lower(v.name) like '%машинн%обучен%%')
                        
                        group by A.name
                        order by count_vacancies desc
                        limit 5
'''
df = pd.read_sql_query(query_ed_2, connection)
df

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\2473105048.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_ed_2, connection)

              name  count_vacancies
0           Москва              217
1  Санкт-Петербург               64
2      Новосибирск               23
3  Нижний Новгород               20
4           Казань               16

In [450]:
query_ed_3 = f'''
                select
                        key_skills
                        
                        from public.vacancies
                        where (lower(name) like '%data scientist%' 
                        or lower(name) like '%data science%' 
                        or lower(name) like '%исследователь данных%'
                        or (name like '%ML%' and lower(name) not like '%html%') 
                        or lower(name) like '%machine learning%' 
                        or lower(name) like '%машинн%обучен%%')
                        
                        and key_skills is not null
                        
                        group by key_skills
                        
'''
df = pd.read_sql_query(query_ed_3, connection)

C:\Users\sveta\AppData\Local\Temp\ipykernel_1552\3613837960.py:18: UserWarning:

pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.

In [451]:

# По запросу query_ed_3 получаем данные по навыкам для DS создаем словарь навыков, где в качестве ключа навык,
# а значение: частота его упоминания в вакансиях (только заполненные навыки)
count_skills = {}
for i in range(0, df.shape[0]):
    df_1 = df.iloc[i][0]
    df_2 = df_1.split('\t')
    for j in df_2:
        if j not in count_skills.keys():
            count_skills[j] = 1
        else:
            count_skills[j] += 1
            
# Сортируем словарь навыков по значениям
sorted_values = sorted(count_skills.values())
sorted_count_skills = {}

for i in sorted_values:
    for k in count_skills.keys():
        if count_skills[k] == i:
            sorted_count_skills[k] = count_skills[k]
            break
# Печатаем ТОП-5 навыков из словаря
print(list(sorted_count_skills.keys())[-5:])

# ТОП-5 навыков для DS специалиста: Git, Математическая статистика, Machine Learning, SQL, Python

['Git', 'Математическая статистика', 'Machine Learning', 'SQL', 'Python']

*подведем итог исследования, обобщите выводы*
*здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования*
## Итоговый вывод:

Данные содержат 49197 вакансий, в них есть вакансии для Data Scientist (далее DS).<br>
По упоминанию 'данных' в названии есть 1771 вакансий.  Если задать более точный поиск (конкретно для DS) - 480 вакансий (Доп исследование query_ed_1).<br>
Есть вакансии для начинающего специалиста DS, их 51.<br>
<br>
Представлены вакансии в разных городах (1362 регионов), все города-миллионники присутствуют в БД, в них есть вакансии.<br>
Для DS вакансии представлены в 52 регионах, ТОП-5 городов, где максимальное количество вакансий для DS: Москва, Санкт-Петербург, Новосибирск, Нижний Новгород, Казань (Доп исследование query_ed_2)<br>
<br>
В данных представлены различные типы трудоустройства и типы рабочего графика, на любой запрос. Из 23501 работодателей
сфера деятельности указана у 8419 работодателей, а "Разработка программного обеспечения" указана у 3553 работодателей.<br>
<br>
Есть вакансии таких крупных работодателей как Яндекс, Газпром и другие.<br>
<br>
Так же при исследовании навыков для DS специалистов, выяснилось, что навыки SQL и Postgres указаны в 201 вакансии, а Python в 351 вакансии.<br>
Дополнительные исследования помогли определить ТОП-5 навыков для DS специалиста: Git, Математическая статистика, Machine Learning, SQL, Python (Доп исследование query_ed_3).